In [51]:
import pandas as pd
import numpy as np

import warnings
warnings.filterwarnings("ignore")

In [4]:
raw_csv_data = pd.read_csv("./input/013 IndexE8.csv")
df_comp = raw_csv_data.copy()

In [12]:
df_comp.date.describe()

count           6269
unique          6269
top       24/08/2001
freq               1
Name: date, dtype: object

In [15]:
df_comp.date = pd.to_datetime(df_comp.date, dayfirst=True)

In [16]:
df_comp.head()

        date     spx      dax     ftse    nikkei
0 1994-01-07  469.90  2224.95  3445.98  18124.01
1 1994-01-10  475.27  2225.00  3440.58  18443.44
2 1994-01-11  474.13  2228.10  3413.77  18485.25
3 1994-01-12  474.17  2182.06  3372.02  18793.88
4 1994-01-13  472.47  2142.37  3360.01  18577.26

In [18]:
df_comp.date.describe()

count                    6269
unique                   6269
top       1999-08-23 00:00:00
freq                        1
first     1994-01-07 00:00:00
last      2018-01-29 00:00:00
Name: date, dtype: object

### Setting the index

In [21]:
df_comp.set_index('date',inplace = True)

In [22]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### Setting the Desired Frequency

In [26]:
df_comp = df_comp.asfreq('b')

In [27]:
df_comp.head()

               spx      dax     ftse    nikkei
date
1994-01-07  469.90  2224.95  3445.98  18124.01
1994-01-10  475.27  2225.00  3440.58  18443.44
1994-01-11  474.13  2228.10  3413.77  18485.25
1994-01-12  474.17  2182.06  3372.02  18793.88
1994-01-13  472.47  2142.37  3360.01  18577.26

### Handling Missin Values

In [28]:
df_comp.isna().sum()

spx       8
dax       8
ftse      8
nikkei    8
dtype: int64

In [29]:
df_comp.spx = df_comp.spx.fillna(method = 'ffill')

In [30]:
df_comp.isna().sum()

spx       0
dax       8
ftse      8
nikkei    8
dtype: int64

In [31]:
df_comp.ftse = df_comp.ftse.fillna(method  = 'bfill')

In [32]:
df_comp.isna().sum()

spx       0
dax       8
ftse      0
nikkei    8
dtype: int64

In [33]:
df_comp.dax = df_comp.dax.fillna(value = df_comp.dax.mean())

In [34]:
df_comp.isna().sum()

spx       0
dax       0
ftse      0
nikkei    8
dtype: int64

In [35]:
df_comp['market_value'] = df_comp.spx

In [40]:
del df_comp['spx'], df_comp['ftse'], df_comp['dax'], df_comp['nikkei']

In [43]:
df_comp.head()

            market_value
date
1994-01-07        469.90
1994-01-10        475.27
1994-01-11        474.13
1994-01-12        474.17
1994-01-13        472.47

### Splitting the Data

In [44]:
size = int(len(df_comp)*0.8)

In [46]:
df = df_comp.iloc[:size]

In [47]:
df_test = df_comp.iloc[size:]

In [49]:
df.tail()

            market_value
date
2013-04-01   1562.173837
2013-04-02   1570.252238
2013-04-03   1553.686978
2013-04-04   1559.979316
2013-04-05   1553.278930

In [50]:
df_test.head()

            market_value
date
2013-04-08   1563.071269
2013-04-09   1568.607909
2013-04-10   1587.731827
2013-04-11   1593.369863
2013-04-12   1588.854623